{"author":{"name":"Matt Crouch","image":"/images/matt-crouch.jpg"},"image":"/images/sapper.png","title":"What is Sapper?","slug":"what-is-sapper","html":"<p>Sapper touts itself as &quot;the next small thing in web development&quot;. It may just be.</p>\n<p>Sapper is built on top of <a href=\"/blog/what-is-svelte\">Svelte</a> and provides a neat solution for building any lightweight site looking to prioritise speed and performance.</p>\n<p>In addition to Svelte&#39;s impressive feature-set, Sapper provides a few more added behaviour out of the box, such as server-side rendering, automatic code-splitting and tools to help generate service workers. All of this is to help make fast sites by default, without sacrificing the developer experience.</p>\n<h2 id=\"integration-with-svelte\">Integration with Svelte</h2>\n<p>Each page is a <code>svelte</code> component. This makes it easier for Sapper to extract information such as critical CSS, templated HTML and any data required to render the page upfront.</p>\n<p>Each <code>svelte</code> page component lives inside the <code>/routes</code> directory. Sapper can look in here and start building the structure of the web site without needing any specific config.</p>\n<h2 id=\"getting-started\">Getting started</h2>\n<p>Sapper is not quite ready for version 1 just yet, but the developers actively encourage people do download and try it out. The example project, <a href=\"https://github.com/sveltejs/sapper-template\">sapper-template</a> generates a fully-working site out of the box to customise as required. This site here was built with that exact template!</p>\n<h2 id=\"the-end-result\">The end result</h2>\n<p>When building a Sapper project, the resulting set of files come in two parts - the server-side and client-side code.</p>\n<p>Server code is generally minimal and is all that is needed to host a Sapper app. It is responsible for creating that first render that gets sent to the browser.</p>\n<p>Client-side code powers whatever happens next. This includes small functions to rehydration of the app after loading, the handling of the routes and the logic behind prefetching. This is all provided for us. All we need to do is build the <code>svelte</code> components to power it.</p>\n"}